import { View, Text, FlatList, SafeAreaView } from 'react-native'
import React, { useState } from 'react'
import FaqItem from './FaqItem';

const Faq = () => {

  const FAQData = [
    {
      id: '1',
      question: 'Как зарегистрироваться в приложении?',
      answer: 'Для регистрации откройте приложение и следуйте инструкциям на экране. Вам потребуется ввести номер телефона, создать PIN-код и подтвердить личные данные.'
    },
    {
      id: '2',
      question: 'Как восстановить доступ, если я забыл PIN-код?',
      answer: 'Нажмите "Забыли PIN?" на экране входа и следуйте инструкциям для восстановления доступа. Это может потребовать подтверждения через SMS или биометрию.'
    },
    {
      id: '3',
      question: 'Как перевести деньги?',
      answer: 'Перейдите в раздел "Переводы", выберите счет получателя (или введите реквизиты), укажите сумму и нажмите "Отправить". Для подтверждения может понадобиться одноразовый пароль (OTP).'
    },
    {
      id: '4',
      question: 'Как оплатить счета?',
      answer: 'В разделе "Платежи" выберите нужную категорию, укажите сумму и нажмите "Оплатить". Вы получите подтверждение после успешной транзакции.'
    },
    {
      id: '5',
      question: 'Как проверить баланс счета?',
      answer: 'Перейдите в раздел "Счета" на главной странице приложения, чтобы увидеть текущий баланс вашего счета и последние транзакции.'
    },
    {
      id: '6',
      question: 'Как активировать уведомления о транзакциях?',
      answer: 'В настройках приложения выберите "Уведомления" и активируйте уведомления о транзакциях. Вы можете настроить типы уведомлений по вашему усмотрению.'
    },
    {
      id: '7',
      question: 'Как изменить язык интерфейса приложения?',
      answer: 'Перейдите в настройки приложения, выберите раздел "Язык" и выберите предпочтительный язык из доступного списка.'
    },
    {
      id: '8',
      question: 'Как связаться с поддержкой клиентов?',
      answer: 'Вы можете обратиться в службу поддержки через раздел "Помощь" в приложении или позвонить по указанному номеру телефона в контактах.'
    },
  ];


  const [openIndex, setOpenIndex] = useState(null);

  const toggleFAQ = (index) => {
    setOpenIndex(openIndex === index ? null : index);
  };

  return (
    <>
      <Text className="font-semibold text-lg">Ответы на вопросы</Text>
      <SafeAreaView>
        <FlatList
          className="ml-1"
          data={FAQData}
          keyExtractor={(item) => item.id}
          renderItem={({ item, index }) => (
            <FaqItem
              question={item.question}
              answer={item.answer}
              isOpen={openIndex === index}
              toggleOpen={() => toggleFAQ(index)}
            />
          )}

        />
      </SafeAreaView>
    </>
  );
}

export default Faq